---
type: EditScope
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# EditScope

`Autodesk.Revit.DB.EditScope` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Cancel | 2014 | `public void Cancel ()` |
| Method | Commit | 2014 | `public void Commit ( IFailuresPreprocessor failurePreprocessor )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsActive | 2014 | `public bool IsActive { get ; }` |
| Property | IsPermitted | 2014 | `public bool IsPermitted { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |